0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x6.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>CRC_0</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SINITEN</name>
							<description>Seed Initialization Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not initialize the CRC module to the value set by the SEED bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Initialize the CRC module to the value set by the SEED bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEED</name>
							<description>Seed Setting. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ALL_ZEROES</name>
									<description>CRC seed value is all 0's (0x00000000)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALL_ONES</name>
									<description>CRC seed value is all 1's (0xFFFFFFFF).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRCEN</name>
							<description>CRC Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable CRC operations.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable CRC operations.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLYSEL</name>
							<description>Polynomial Selection. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CRC_32_04C11DB7</name>
									<description>Select 32-bit polynomial: 0x04C11DB7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_16_1021</name>
									<description>Select 16-bit polynomial: 0x1021.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_16_3D65</name>
									<description>Select 16-bit polynomial: 0x3D65.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRC_16_8005</name>
									<description>Select 16-bit polynomial: 0x8005.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BMDEN</name>
							<description>Byte Mode Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable byte mode (word/byte width is determined automatically by the hardware).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable byte mode (all writes are considered as bytes).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BBREN</name>
							<description>Byte-Level Bit Reversal Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No byte-level bit reversal (input is same order as written).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Byte-level bit reversal enabled (the bits in each byte are reversed).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORDER</name>
							<description>Input Processing Order. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_REORDER</name>
									<description>No byte reorientation (output is same order as input).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_16</name>
									<description>Swap for 16-bit big endian order (input: B3 B2 B1 B0, output: B2 B3 B0 B1).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIG_ENDIAN_32</name>
									<description>Swap for 32-bit big endian order (input: B3 B2 B1 B0, output: B0 B1 B2 B3).</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Input/Result Data</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>Input/Result Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RDATA</name>
					<description>Bit-Reversed Output Data</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDATA</name>
							<description>Bit-Reversed Output Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
