0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x6.svd
				<register>
					<name>CHSWRCN</name>
					<description>Channel Software Request Control</description>
					<addressOffset>0x14</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Channel 0 Software Request. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 0 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 0 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 Software Request. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 1 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 1 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 Software Request. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 2 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 2 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Channel 3 Software Request. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 3 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 3 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 Software Request. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 4 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 4 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5</name>
							<description>Channel 5 Software Request. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 5 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 5 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 Software Request. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 6 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 6 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 Software Request. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 7 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 7 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 Software Request. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 8 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 8 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9</name>
							<description>Channel 9 Software Request. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 9 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 9 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH10</name>
							<description>Channel 10 Software Request. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 10 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 10 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH11</name>
							<description>Channel 11 Software Request. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 11 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 11 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH12</name>
							<description>Channel 12 Software Request. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 12 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 12 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH13</name>
							<description>Channel 13 Software Request. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 13 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 13 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH14</name>
							<description>Channel 14 Software Request. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 14 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 14 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH15</name>
							<description>Channel 15 Software Request. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 15 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 15 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHREQMSET</name>
					<description>Channel Request Mask Set</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Channel 0 Request Mask Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 0 peripheral data requests enabled. 1: DMA Channel 0 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 0 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 Request Mask Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 1 peripheral data requests enabled. 1: DMA Channel 1 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 1 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 Request Mask Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 2 peripheral data requests enabled. 1: DMA Channel 2 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 2 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Channel 3 Request Mask Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 3 peripheral data requests enabled. 1: DMA Channel 3 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 3 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 Request Mask Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 4 peripheral data requests enabled. 1: DMA Channel 4 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 4 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5</name>
							<description>Channel 5 Request Mask Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 5 peripheral data requests enabled. 1: DMA Channel 5 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 5 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 Request Mask Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 6 peripheral data requests enabled. 1: DMA Channel 6 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 6 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 Request Mask Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 7 peripheral data requests enabled. 1: DMA Channel 7 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 7 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 Request Mask Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 8 peripheral data requests enabled. 1: DMA Channel 8 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 8 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9</name>
							<description>Channel 9 Request Mask Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 9 peripheral data requests enabled. 1: DMA Channel 9 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 9 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH10</name>
							<description>Channel 10 Request Mask Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 10 peripheral data requests enabled. 1: DMA Channel 10 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 10 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH11</name>
							<description>Channel 11 Request Mask Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 11 peripheral data requests enabled. 1: DMA Channel 11 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 11 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH12</name>
							<description>Channel 12 Request Mask Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 12 peripheral data requests enabled. 1: DMA Channel 12 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 12 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH13</name>
							<description>Channel 13 Request Mask Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 13 peripheral data requests enabled. 1: DMA Channel 13 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 13 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH14</name>
							<description>Channel 14 Request Mask Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 14 peripheral data requests enabled. 1: DMA Channel 14 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 14 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH15</name>
							<description>Channel 15 Request Mask Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: 0: DMA Channel 15 peripheral data requests enabled. 1: DMA Channel 15 peripheral data requests disabled. Write: 0: No effect (use CHREQMCLR to clear). 1: Disable DMA Channel 15 peripheral data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
