0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x6.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PBHD_4</name>
			<version>A</version>
			<description>None</description>
			<groupName>PBHD_4</groupName>
			<baseAddress>0x4002a3c0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>PB</name>
					<description>Output Latch</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x0000003F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PB</name>
							<description>Output Latch. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PBPIN</name>
					<description>Pin Value</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBPIN</name>
							<description>Pin Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PBMDSEL</name>
					<description>Mode Select</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x0000003F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBMDSEL</name>
							<description>Mode Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PBDEN</name>
					<description>Driver Enable</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBNDEN</name>
							<description>Port Bank N-Channel Driver Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>PBPDEN</name>
							<description>Port Bank P-Channel Driver Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PBDRV</name>
					<description>Drive Strength</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBDRV</name>
							<description>Drive Strength. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>PBPUEN</name>
							<description>Port Bank Weak Pull-up Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable weak pull-ups for this port.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable weak pull-ups for this port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBLVMD</name>
							<description>Port Low Voltage Mode. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Port configured for normal mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Port configured for low power mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBSLEW</name>
							<description>Port Slew Control. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FASTEST</name>
									<description>Select the fastest transition speed for this port bank.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FASTER</name>
									<description>Select the faster transition speed for this port bank.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLOWER</name>
									<description>Select the slower transition speed for this port bank.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLOWEST</name>
									<description>Select the slowest transition speed for this port bank.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBBIASEN</name>
							<description>Port Bias Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the biasing to the port pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the biasing to the port pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBDRVEN</name>
							<description>Port Drive Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the port drivers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the port drivers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBVTRKEN</name>
							<description>Port Voltage Supply Tracking Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable VIOHD tracking.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable VIOHD tracking.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PBILIMIT</name>
					<description>Current Limit</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBILEN</name>
							<description>Current Limit Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>NILIMIT</name>
							<description>N-Channel Current Limit. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Set sink limit to mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Set sink limit to mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Set sink limit to mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Set sink limit to mode 3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE4</name>
									<description>Set sink limit to mode 4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE5</name>
									<description>Set sink limit to mode 5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE6</name>
									<description>Set sink limit to mode 6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE7</name>
									<description>Set sink limit to mode 7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE8</name>
									<description>Set sink limit to mode 8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE9</name>
									<description>Set sink limit to mode 9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE10</name>
									<description>Set sink limit to mode 10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE11</name>
									<description>Set sink limit to mode 11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE12</name>
									<description>Set sink limit to mode 12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE13</name>
									<description>Set sink limit to mode 13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE14</name>
									<description>Set sink limit to mode 14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE15</name>
									<description>Set sink limit to mode 15.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PILIMIT</name>
							<description>P-Channel Current Limit. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Set source limit to mode 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Set source limit to mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Set source limit to mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Set source limit to mode 3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE4</name>
									<description>Set source limit to mode 4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE5</name>
									<description>Set source limit to mode 5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE6</name>
									<description>Set source limit to mode 6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE7</name>
									<description>Set source limit to mode 7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE8</name>
									<description>Set source limit to mode 8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE9</name>
									<description>Set source limit to mode 9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE10</name>
									<description>Set source limit to mode 10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE11</name>
									<description>Set source limit to mode 11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE12</name>
									<description>Set source limit to mode 12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE13</name>
									<description>Set source limit to mode 13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE14</name>
									<description>Set source limit to mode 14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE15</name>
									<description>Set source limit to mode 15.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PBFSEL</name>
					<description>Function Select</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PB0SEL</name>
							<description>Port Bank n.0 Function Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB1SEL</name>
							<description>Port Bank n.1 Function Select. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB2SEL</name>
							<description>Port Bank n.2 Function Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART1</name>
									<description>Pin configured for UART1 TX.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB3SEL</name>
							<description>Port Bank n.3 Function Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART1</name>
									<description>Pin configured for UART1 RX.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB4SEL</name>
							<description>Port Bank n.4 Function Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART1</name>
									<description>Pin configured for UART1 RTS.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB5SEL</name>
							<description>Port Bank n.5 Function Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>Pin configured for GPIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PMLS</name>
									<description>Pin configured for Port Mapped Level Shift.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0</name>
									<description>Pin configured for EPCA0 output.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART1</name>
									<description>Pin configured for UART1 CTS.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTIMER0</name>
									<description>Pin configured for LPTIMER0 toggle output.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
